// 간단한 호텔 예약화면을 만들어보고자 합니다.
// 이 화면에서는 다음의 기능을 만들어야 합니다.
// 1. 호텔에 묵을 날짜, 시간을 설정할 수 있어야 합니다.
// 2. 묵을 호텔방을 다음의 목록 중에서 하나를 선택해야 합니다. (스위트룸, 오션뷰, 시티뷰)
// 3. 호텔에 묵으실 사용자의 이름을 입력해야 합니다.
// 4. 호텔의 옵션 중 하나인 아침식사 서비스를 키고 끌 수 있는 기능이 들어가야 합니다.
// 5. 이 4가지의 기능을 전부 선택하고 난 후에, [이 호텔에 묵는 것을 동의합니다.] 라는 내용의
//    체크박스가 존재하여, 마지막에 선택을 할 수 있어야 합니다.
// 6. 이 체크박스를 선택한 후에, 맨 밑에 있는 ElevatedButton을 클릭했을 때
//    사용자의 예약 정보를 반환하는 AlertDialog가 발생해야 합니다.

// 최종 AlertDialog 내용은 다음과 같습니다.
// 제목: OOO님의 호텔 예약 결과
// 내용:
// 묵으실 날짜 : 0000-00-00
// 묵으실 시간 : AM 00:00
// 호텔방 옵션 : 스위트룸
// 아침식사 서비스 여부 : 없음

// 묵으실 날짜 부분에서 0000-00-00은 0000-00-00 00:00:00.000 으로 떠도 괜찮습니다.
